{
    "sidebar-name": "Adam Lawrence",
    "sidebar-my-current-status": "PhD Candidate at UIUC",
    "sidebar-bio-1": "Computational Mechanics",
    "sidebar-bio-2": "Environmental Modelling",
    "sidebar-bio-3": "History and Geography",
    "nav-home": "Home",
    "nav-projects": "Projects",
    "nav-writings": "Writings",
    "nav-publications": "Publications",
    "nav-resume": "Resume",
    "header-home": "Home",
    "header-projects": "Projects",
    "header-writings": "Writings",
    "header-resume": "Resume",
    "footer-text": "&copy; %YEAR% Adam Lawrence | Last updated on <span id=\"last-updated\"></span>",
    "about-header": "About Me",
    "about-p1": "I am a first year PhD student at the University of Illinois Urbana-Champaign, within the department of Civil and Environmental Engineering. My research entails all aspects of computational mechanics and modelling, mainly in free surface hydrodynamics, but also on more unique applications such as photopolymerization. I am under the guidance of Professor <a href=\"https://yan.cee.illinois.edu/\">Jinhui Yan</a>.",
    "about-p2": "I hail from the Melbourne, Australia, where I completed my undergraduate and master's in environmental engineering, specializing in hydraulic engineering with a minor in computer science. I am an AUKUS fellow, awarded by the Australian-American Association, to strengthen ties between our two great countries.",
    "about-p3": "Here on this website, you will find a collection of my ongoing work, not just from my current research, but also personal projects and interests.",
    "about-p4": "To aid in my PhD research, I have developed a plethora of currently closed source projects. <a href=\"projects/Torrentem.html\">Torrentem</a>; a general numerical PDE solver, solving multiscale problems from large hydrodynamic flows to minuscule additive manufacturing processes. <a href=\"projects/Ostium.html\">Ostium</a>; a library to process and integrate geospatial data, that can work with Torrentem. <a href=\"projects/Vadum.html\">Vadum</a>; a visualisation library for results from Torrentem.",
    "about-p5": "I have a keen interest in Literature, History, Geography, and the Environment. I believe current teaching standards are lacking, and incorporating these elements into my projects through visual storytelling helps to effectively engage people, especially when communicating complex scientific concepts. Examples of my approach can be found on my <a href=\"writings.html\">writings</a> page and my <a href=\"https://www.youtube.com/@arlawrence\">YouTube</a>.",
    "about-p6": "For any enquiries or collaboration, including summer internship opportunities, feel free to reach out via email at <a href=\"mailto:adamrl3@illinois.edu\" class=\"content-link\">adamrl3@illinois.edu</a>.",
    "projects-header": "Projects",
    "writings-header": "Writings",
    "publications-header": "Publications"
}
